# 1
# У нас є список показань заборгованостей з комунальних послуг наприкінці місяця. Заборгованості можуть бути від'ємними — у нас переплата, чи додатними, якщо необхідно сплатити за рахунками. Напишіть функцію amount_payment, яка приймає на вхід список платежів, підсумовує додатні значення та повертає суму платежу наприкінці місяця.

def amount_payment(payment):
    amount = 0
    for p in payment:
        if p > 0:
            amount += p
    return amount

# 2
# При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі. Напишіть функцію prepare_data, яка видаляє з переданого списку найбільше та найменше значення, сортує його в порядку зростання і повертає змінений список як результат.

def prepare_data(data):
    sorted_data = sorted(data)
    sorted_data.pop()
    sorted_data.pop(0)
    return sorted_data