# На першому етапі вам потрібно реалізувати функцію для виведення списку 
# колег, яких потрібно привітати з днем народження на тижні.
# У вас є список словників users, кожен словник у ньому обов'язково має 
# ключі name та birthday. Де name — це рядок з ім'ям користувача, 
# а birthday — це datetime об'єкт, в якому записаний день народження.
# Наприклад: {"name": "Bill Gates", "birthday": datetime(1955, 10, 28)}
# Ваше завдання написати функцію get_birthdays_per_week, яка отримує на вхід 
# список users і виводить у консоль (за допомогою print) список користувачів, 
# яких потрібно привітати по днях на наступному тижні.
