''' 
Підсписком (sublist) називають список, що є складовою більшого списку. 
Підсписок може містити один елемент, множину елементів або бути порожнім.
Наприклад, [1], [2], [3] та [4] є підсписками списку [1, 2, 3, 4]. 
Список [2, 3] також входить до складу [1, 2, 3, 4], але при цьому список [2, 4] 
не є підсписком [1, 2, 3, 4], оскільки у вихідному списку числа 2 і 4 не є сусідами.
Порожній список є підсписком будь-якого списку.
Напишіть функцію all_sub_lists, що повертає список, який містить всі можливі підсписки заданого.
Наприклад, якщо функції передано аргумент список [1, 2, 3], то функція має повернути 
наступний список: [[], [1], [2], [3], [1, 2], [2, 3], [1, 2, 3]].
Функція all_sub_lists повинна повертати щонайменше один список з порожнім підсписком [[]].
'''
def all_sub_lists(data):
    if data == []:
        return [[]]
    else:
        sub = []
        sub.append([])
        for el in data:
            sub.append([el])
        
        for i in range(len(data)-1):
            sub.append([data[i], data[i + 1]])
        
        for i in range(len(data)-2):
            sub.append([data[i], data[i + 1], data[i + 2]])
        sub.append(data)

    #print(sub)
    return sub

# data = [1, 2, 3]
# all_sub_lists(data)

